app/controllers/authors_controller.rb

SELECT `authors`.* FROM `authors` WHERE (1 = 1   AND authors.authors_name LIKE '%Jam%')
SELECT 1 AS one FROM `authors` LIMIT 1
SELECT `authors`.* FROM `authors`
SELECT 1 AS one FROM `authors` WHERE (1 = 1   AND authors.authors_name LIKE '%Jam%') LIMIT 1
SELECT 1 AS one FROM `authors` WHERE (1 = 1   AND authors.authors_name LIKE '%ikbal%') LIMIT 1
SELECT `authors`.* FROM `authors` WHERE (1 = 1   AND authors.authors_name LIKE '%ikbal%')
---
    def Read(authors_name, authors_id)
      param = AdvSqlParamGeneratorMiddleware.new(nil).send(:AdvSqlParamGenerator, [
        {
            'Table' => 'authors',
            'Field' => 'authors_name',
            'Value' => authors_name.present? ? "'%#{authors_name}%'" : nil,
            'Syntax' => 'LIKE'
          },
          {
            'Table' => 'authors',
            'Field' => 'authors_id',
            'Value' => authors_id.present? ? "'#{authors_id}'" : nil,
            'Syntax' => '='
          }
        ])
        param = "1 = 1  #{param}"
      authors = Author.where(param)

      if authors.any?
        author_data = authors.map { |author| { authors_id: author.id, authors_name: author.authors_name } }

INSERT INTO `authors` (`authors_name`) VALUES ('Yayan')
---
    def Create(authors_name)

      authors = Author.new(authors_name: authors_name)
        if authors.save # Jika query berhasil dijalankan

SELECT `authors`.* FROM `authors` WHERE `authors`.`authors_id` = 3 LIMIT 1
UPDATE `authors` SET `authors`.`authors_name` = 'Yayan Kurniawan' WHERE `authors`.`authors_id` = 3
---
      def Update(authors_name, authors_id)
        authors = Author.find_by(authors_id: authors_id) # Asumsi authors_id adalah parameter yang Anda terima
        if authors
          if authors.update(authors_name: authors_name)

SELECT `authors`.* FROM `authors` WHERE `authors`.`authors_id` = 3 LIMIT 1
DELETE FROM `authors` WHERE `authors`.`authors_id` = 3
---
      def Delete(authors_id)
        authors = Author.find_by(authors_id: authors_id) # Asumsi authorss_id adalah parameter yang Anda terima
        if authors
          if authors.destroy