app/controllers/books_controller.rb

SELECT `authors`.* FROM `authors` WHERE `authors`.`authors_id` = 1 LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`book_id` = 2 LIMIT 1
SELECT COUNT(*) FROM `books` INNER JOIN `authors` ON `authors`.`authors_id` = `books`.`author_id` WHERE (1 = 1  AND authors.authors_name LIKE '%james%' AND books.book_name LIKE '%ayam%')
---
      def Read(book_name, authors_id, book_id, authors_name,tahun_terbit,page,per_page)
        param = AdvSqlParamGeneratorMiddleware.new(nil).send(:AdvSqlParamGenerator, [
          {
              'Table' => 'authors',
              'Field' => 'authors_name',
              'Value' => authors_name.present? ? "'%#{authors_name}%'" : nil,
              'Syntax' => 'LIKE'
            },
            {
              'Table' => 'authors',
              'Field' => 'authors_id',
              'Value' => authors_id.present? ? "'#{authors_id}'" : nil,
              'Syntax' => '='
            },
            {
              'Table' => 'books',
              'Field' => 'book_name',
              'Value' => book_name.present? ? "'%#{book_name}%'" : nil,
              'Syntax' => 'LIKE'
            },
            {
              'Table' => 'books',
              'Field' => 'book_id',
              'Value' => book_id.present? ? "'#{book_id}'" : nil,
              'Syntax' => '='
            },
            {
              'Table' => 'books',
              'Field' => 'tahun_terbit',
              'Value' => tahun_terbit.present? ? "'#{tahun_terbit}'" : nil,
              'Syntax' => '='
            }
          ])
          param = "1 = 1 #{param}"

          total_count = Book.joins(:author).where(param).count

SELECT COUNT(*) FROM `books` INNER JOIN `authors` ON `authors`.`authors_id` = `books`.`author_id` WHERE (1 = 1  AND books.book_id = 'Africa, often referred to as the cradle of humanity, is a continent of unparalleled diversity and rich cultural heritage. Spanning over 30 million square kilometers, it is the second-largest and second-most populous continent on Earth. From its breathtaking landscapes to its vibrant cultures, Africa is a continent that continues to captivate the world.')
SELECT books.*, authors.authors_name FROM `books` INNER JOIN `authors` ON `authors`.`authors_id` = `books`.`author_id` WHERE (1 = 1  AND books.book_id = '1') LIMIT 30 OFFSET 0
---
          page = params[:page] || page
          per_page = params[:per_page] || per_page

          books = Book.joins(:author)
            .select('books.*, authors.authors_name') # Ganti 'name' dengan kolom yang sesuai di tabel authors
            .where(param)
            .paginate(page: page, per_page: per_page)

SELECT `users`.* FROM `users` WHERE `users`.`users_id` = NULL LIMIT 1
INSERT INTO `books` (`book_name`, `author_id`, `book_content`, `tahun_terbit`) VALUES ('Ayam ', 2, 'ayam sakiy', '2020')
---
      def Create(book_name, authors_id, book_content, users_id,tahun_terbit)
        user = User.find_by(users_id: users_id)

        if user.present?
          @book = Book.new(book_name: book_name, author_id: authors_id, book_content: book_content, tahun_terbit:tahun_terbit)

          if @book.save # Jika query berhasil dijalankan

SELECT `books`.* FROM `books` WHERE `books`.`book_id` = 14 LIMIT 1
UPDATE `books` SET `books`.`book_content` = 'Bercerita tentang seorang pemuda sakti bernama Sangkuriang, yang jatuh cinta dan ingin menikahi Dayang Sumbi, ibu kandungnya. Dayang Sumbi mengajukan syarat agar Sangkuriang membangun perahu dalam satu malam. Sangkuriang hampir menyelesaikan pekerjaan tersebut, tetapi Dayang Sumbi menggagalkannya dengan cara memaksa ayam berkokok pada saat hari masih gelap gulita. Sangkuriang marah dan menendang kapal yang sedang dibuatnya hingga tertelungkup berubah menjadi gunung yang dikenal sebagai Tangkuban Parahu. Kemudian, dia mengejar Dayang Sumbi yang berubah menjadi bukit dikenal sebagai gunung Putri. Sangkuriang yang tidak dapat menemukan Dayang Sumbi pun akhirnya menghilang ke alam gaib. Pesan moral: bersikaplah jujur dan hindari perbuatan curang.' WHERE `books`.`book_id` = 1
---
        def Update(book_name,authors_id,book_id,book_content,tahun_terbit)
          books = Book.find_by(book_id: book_id) # Asumsi authors_id adalah parameter yang Anda terima
          if books
            if books.update(book_name: book_name, author_id: authors_id, book_content:book_content,tahun_terbit:tahun_terbit)

SELECT `books`.* FROM `books` WHERE `books`.`book_id` = 14 LIMIT 1
DELETE FROM `books` WHERE `books`.`book_id` = 14
---
        def Delete(book_id)
          books = Book.find_by(book_id: book_id)
          if books
            if books.destroy