app/controllers/users_controller.rb

    def Read(users_email, users_password, db_connection)

      user = User.find_by(email:users_email, password:Digest::MD5.hexdigest(users_password))
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'bilmanprogrammer@gmail.com' AND `users`.`password` = '81dc9bdb52d04dc20036dbd8313ed055' LIMIT 1

    def Create(users_name, users_email, users_password, level)

      encrypted_password = Digest::MD5.hexdigest(users_password)

        user = User.new(email: users_email, username: users_name, password: encrypted_password,level: level)
        if user.save # Jika query berhasil dijalankan
---
INSERT INTO `users` (`username`, `email`, `password`, `level`) VALUES ('user01', 'bilmanbudiluhur@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', 2)

      def Update(users_name, users_email, users_password,users_id, level)
        user = User.find_by(users_id: users_id) # Asumsi user_id adalah parameter yang Anda terima
        if user
          if user.update(email: users_email, username: users_name, level: level)
---
SELECT `users`.* FROM `users` WHERE `users`.`users_id` = 3 LIMIT 1
UPDATE `users` SET `users`.`username` = 'user', `users`.`email` = 'programmer@gmail.com', `users`.`level` = NULL WHERE `users`.`users_id` = 3

      def Delete(users_id)
        user = User.find_by(users_id: users_id) # Asumsi users_id adalah parameter yang Anda terima
        if user
          if user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`users_id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`users_id` = 2